module.exports = {
    id: 4,
    name: '杏子',
    title: '无拘算命师',
    tag: '爆发',
    description: '听天由命，伺机行动',
    maxHP: 6,
    atk: 15,
    def: 5,
    maxSP: 6,
    initSP: 0,
    talent: {
        name: '走险',
        description: '若闪避判定成功，自身SP+1。'
    },
    skills: [
        { id: 1, name: '度算', type: 'passive', timing: 'before', spCost: 0, description: '自身按不同的行动值大小获得不同增益：行动判定点数1--70，ATK永久+3（最多+15）；行动判定点数71--150，立即使自身SP+1,SP上限+1（通过这种方式SP上限最多+5）；行动判定点数151以上，对人造成的普通伤害+1（无上限）。' },
        { id: 2, name: '厚积', type: 'active', timing: 'before', spCost: 1, description: '使本回合双方在本回合【前】技能释放步骤结束后跳过本回合的行动值比拼步骤，直接使对方成为进攻方，我方成为防守方。本回合我方受到的普通伤害-1。下一回合的行动值比拼步骤的我方的随机数取2次，取大的那一个作为本回合行动值比拼步骤中我方的随机数。本回合进行一技能判定时，行动判定点数的值改为本回合所取得两个随机数相加再加上我方当前的ATK。（若该技能在本回合释放后下回合禁用）' },
        { id: 3, name: '定命', type: 'active', timing: 'before', spCost: 7, description: '指定一名角色，立刻造成大量伤害：2+增伤+(自身SP上限-4)。增伤：角色通过自身技能或特殊道具获得的另一种数值，与普通伤害叠加，向对手造成更大打击。公式：最终伤害=普通伤害+增伤，增伤效果在闪避判定之前计算。' }
    ]
};
